src/cf/Enums/FileStorageTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>FileStorageTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>InInfobase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InVolumesOnHardDrive</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InBuiltInBinaryDataStorage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InExternalBinaryDataStorage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InVolumesVolumeIsNotDefined</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/WorkingWithFilesInBinaryDataWarehouseIsService/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region Private

// It is called before the transaction start.
// All these files must be filled in for new files.
// 
// Parameters:
//  Context - See FilesOperationsInternal.FileUpdateContext
//
Procedure BeforeUpdatingTheFileData(Context) Export
	FilesOperationsInVolumesInternal.BeforeUpdatingTheFileData(Context);
EndProcedure

// It is called in a modification transaction.
//
// Parameters:
//  Context - See FilesOperationsInternal.FileUpdateContext
//  AttachedFile - DefinedType.AttachedFileObject
//
Procedure BeforeWritingFileData(Context, AttachedFile) Export
	FilesOperationsInVolumesInternal.BeforeWritingFileData(Context, AttachedFile);
EndProcedure

// Called in a modification transaction after saving an attachment.
// 
// Parameters:
//  Context - See FilesOperationsInternal.FileUpdateContext
//  AttachedFile - DefinedType.AttachedFile
//
Procedure WhenUpdatingFileData(Context, AttachedFile) Export
	If AttachedFile.FileStorageType = Enums.FileStorageTypes.InVolumesOnHardDrive Then
		FilesOperationsInVolumesInternal.WhenUpdatingFileData(Context, AttachedFile);
	Else
		FilesOperationsInternal.WhenUpdatingFileData(Context, AttachedFile);
	EndIf;
EndProcedure

// Parameters:
//  Context - See FilesOperationsInternal.FileUpdateContext
//  Success - Boolean - True if the transaction is successfully committed.
//
Procedure AfterUpdatingTheFileData(Context, Success) Export
	FilesOperationsInternal.AfterUpdatingTheFileData(Context, Success);
EndProcedure

// Determines the binary data storage attribute corresponding to the specified file storage type.
//
// Parameters:
//  FilesStorageTyoe - EnumRef.FileStorageTypes
//  GettingFileFromArchive - Boolean
//
// Returns:
//  String
//
Function DetermineAttributesOfBinaryDataStorageByFileStorageType(FilesStorageTyoe, GettingFileFromArchive = False) Export

	If FilesStorageTyoe = Enums.FileStorageTypes.InInfobase Then
		Result = "BinaryData";
	ElsIf FilesStorageTyoe = Enums.FileStorageTypes.InExternalBinaryDataStorage Then
		If GettingFileFromArchive Then
 			Result = "BinaryDataInArchive";			
		Else
 			Result = "BinaryDataInOperationalExternalStorage";
		EndIf;
	ElsIf FilesStorageTyoe = Enums.FileStorageTypes.InBuiltInBinaryDataStorage Then
		Result = "BinaryDataInOperationalBuiltInStorage";
	Else
		Result = "";
	EndIf;

	Return Result;

EndFunction

// Checks whether the file storage option uses disk volumes.
//
// Parameters:
//  FileStorageType - EnumRef.FileStorageTypes
//
// Returns:
//  Boolean
//
Function StorageTypeDoesNotUseDisks(FileStorageType) Export
	
	If FileStorageType = Enums.FileStorageTypes.InInfobase
			Or FileStorageType = Enums.FileStorageTypes.InExternalBinaryDataStorage
			Or FileStorageType = Enums.FileStorageTypes.InBuiltInBinaryDataStorage Then
		Result = True;
	Else
		Result= False;
	EndIf;

	Return Result;

EndFunction

#EndRegion
